	  
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОтборыДинамическихСписков(); 
	
КонецПроцедуры 

#КонецОбласти    

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ВыбранноеСообщение = ?(ТекущиеДанные <> Неопределено, ТекущиеДанные.ИсходящееСообщение, Неопределено);
	УстановитьПараметрВИсторииСообщенияСервер(ВыбранноеСообщение);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции  

&НаСервере
Процедура УстановитьОтборыДинамическихСписков()
	
	УстановитьПараметрВИсторииСообщенияСервер(Неопределено);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрВИсторииСообщенияСервер(ЭлементОтбора = Неопределено)
	
	ПараметрТекущаяСсылка = ИсторияВыбранногоСообщения.Параметры.Элементы.Найти("ВыбранноеСообщение");
	ПараметрТекущаяСсылка.Использование = Истина;
	ПараметрТекущаяСсылка.Значение = ЭлементОтбора;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ИсходящееСообщение" Тогда		
		СтандартнаяОбработка = Ложь;
		ТекДанные = Элемент.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			ПараметрыОткрытия = Новый Структура("Ключ", ТекДанные.ИсходящееСообщение);
			ОткрытьФорму("Справочник.EUF_ПроводникСообщенияИсходящие.Форма.ФормаЭлемента", ПараметрыОткрытия);					
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
  
#КонецОбласти