#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ИдентификаторТипаВходящегоУникален(Объект, Отказ) Экспорт
	
	ТекстСообщения = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТипВходящегоСообщения.Представление КАК Представление,
	|	ТипВходящегоСообщения.Код КАК Код
	|ИЗ
	|	Справочник.EUF_ПроводникТипВходящегоСообщения КАК ТипВходящегоСообщения
	|ГДЕ
	|	ТипВходящегоСообщения.ТехническоеИмя = &ТехническоеИмя
	|	И ТипВходящегоСообщения.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("ТехническоеИмя", Объект.ТехническоеИмя);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ТекстСообщения = СтрШаблон("Тип входящего сообщения с таким техническим именем (мнемокодом) уже существует %1 %2",
									Выборка.Код, Выборка.Представление);		
		Отказ = Истина;							
		Возврат ТекстСообщения;		
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

#КонецЕсли