#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПриКопировании(ОбъектКопирования)
	
	ИдентификаторПодключения = "";
	
КонецПроцедуры
	
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ПроверкаВыполнена") Тогда
		ТекстСообщения = Справочники.EUF_ПроводникПодключенияКВнешнимСистемам.ИдентификаторПодключенияУникален(
																				ЭтотОбъект, Отказ);
		Если Отказ Тогда			
			EUF_ПроводникШлюзБСПКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
