
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Software Authors Name = "Mikhaylov Roman Vadimovich"
// Copyright (c) 2022, Mikhaylov Roman Vadimovich
// Attribution-NonCommercial-ShareAlike 4.0 International (CC BY-NC-SA 4.0)
// https://creativecommons.org/licenses/by-nc-sa/4.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Используется для отладки. Для псевдо вызова функции веб сервиса внешней системы
//
// Параметры:
//  MsgType			 - Строка - Мнемокод для опредеелния типа входящего сообщения
//  MsgID			 - Строка - Идентификатор входящего сообщения (исходящего от внешней системы)
//  MsgBody			 - Произвольный - Данные от внешней системы
//  ExternalSystemID - Строка - Используется для быстрого определения соответствующей внешней системы в текущей базе
//  IntegrationProcessID - Строка - Идентификатор интеграционного процесса (Справочника EUF_ПроводникИнтеграционныеПроцессы) 
//  BodyType		 - Строка - Тип тела запроса (по умолчанию - строка). Используется для определения типа содержимого тела (текст или двоичные данные)
// 
// Возвращаемое значение:
//  Строка, Структура - Данные в формате обмена (в коллекции или непосредственно строкой) 
//
Функция Interaction(MsgType, MsgID, MsgBody, ExternalSystemID, IntegrationProcessID = "", BodyType = "") Экспорт
	
	Возврат "200";
	
КонецФункции	

#КонецЕсли