
Функция CheckConnect(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
    Результат = "";
    Результат = Результат + Запрос.HTTPМетод + Символы.ПС;
    Результат = Результат + Запрос.БазовыйURL + Символы.ПС;
    Результат = Результат + Запрос.ОтносительныйURL + Символы.ПС;
    Результат = Результат + "Заголовки:" + Символы.ПС;
    Для каждого Параметр Из Запрос.Заголовки Цикл
        Результат = Результат + Параметр.Ключ + ":" + Параметр.Значение + Символы.ПС;
    КонецЦикла;
    Результат = Результат + "Параметры URL:" + Символы.ПС;
    Для каждого Параметр Из Запрос.ПараметрыURL Цикл
        Результат = Результат + Параметр.Ключ + ":" + Параметр.Значение + Символы.ПС;
    КонецЦикла;
    Результат = Результат + "Параметры запроса:" + Символы.ПС;
    Для каждого Параметр Из Запрос.ПараметрыЗапроса Цикл
        Результат = Результат + Параметр.Ключ + ":" + Параметр.Значение + Символы.ПС;
	КонецЦикла;
	Результат = Результат + Символы.ПС + ТекущаяДатаСеанса();
    Ответ.УстановитьТелоИзСтроки(Результат);
    Возврат Ответ;

КонецФункции

Функция InteractionPOST(Запрос)
	
	// Определяем HTTPСервисОтвет в модуле сервиса для исключения ошибок,
	// возникающих в случае расположения ее в общих модулях и
	// осуществления при этом к базе по COM
	HTTPСервисОтвет = Новый HTTPСервисОтвет(200); 
	
	HTTPСервисОтвет = EUF_ПроводникОбмен.ОбработатьВходящийЗапросHTTP(Запрос, HTTPСервисОтвет);
	
	Возврат HTTPСервисОтвет;
	
КонецФункции
