
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьИспользованиеСлужебныхРегламентныхЗаданий();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Управление регламентными заданиями

&НаСервере
Процедура УстановитьИспользованиеСлужебныхРегламентныхЗаданий()
	
	ИмяТекущейИБ = ПолучитьПредставлениеИнформационнойБазыНаСервере();
	ИмяИБДляПроверки = НаборКонстант.MultiPort_ИмяИБДляРаботыРеглЗаданий; 	
	МассивИменДляПроверки = СтрРазделить(ИмяИБДляПроверки, ";", Ложь);
	
	Если ЗначениеЗаполнено(ИмяИБДляПроверки) И МассивИменДляПроверки.Найти(ИмяТекущейИБ) <> Неопределено Тогда
		ИспользоватьСлужебныеРегламентныеЗадания = Истина;
	Иначе
		ИспользоватьСлужебныеРегламентныеЗадания = Ложь;
	КонецЕсли;	
	 
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСлужебныеРегламентныеЗаданияПриИзменении(Элемент)
	
	Если ИспользоватьСлужебныеРегламентныеЗадания Тогда
		НаборКонстант.MultiPort_ИмяИБДляРаботыРеглЗаданий = ПолучитьПредставлениеИнформационнойБазыНаСервере();
	Иначе
		НаборКонстант.MultiPort_ИмяИБДляРаботыРеглЗаданий = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПредставлениеИнформационнойБазыНаСервере()	
	Возврат MultiPort_ОбщегоНазначения.ПолучитьПредставлениеИнформационнойБазы();
КонецФункции