#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ПроверкаВыполнена") Тогда
		ТекстСообщения = Справочники.MultiPort_ИнтеграционныеПроцессы.ИдентификаторПроцессаУникален(ЭтотОбъект, Отказ);
		Если Отказ Тогда			
			MultiPort_ШлюзБСПКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли